experiments/deploy-tuning-2026-09-06/abba/round1_B.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f658d2fc040>, trust_remote_code=False, seed=0, num_prompts=96, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8322, endpoint='/v1/chat/completions', header=None, max_concurrency=48, model='qwen38-27b-tp2', input_len=None, output_len=None, tokenizer='<model-dir>', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-45f9390e-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-06 05:47:21 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 48

  0%|          | 0/96 [00:00<?, ?it/s]
  1%|          | 1/96 [00:32<50:50, 32.11s/it]
  2%|▏         | 2/96 [00:32<20:50, 13.30s/it]
  4%|▍         | 4/96 [00:32<07:52,  5.13s/it]
  5%|▌         | 5/96 [00:32<05:26,  3.59s/it]
  7%|▋         | 7/96 [00:33<03:09,  2.13s/it]
  8%|▊         | 8/96 [00:34<02:40,  1.83s/it]
 12%|█▎        | 12/96 [00:35<01:16,  1.09it/s]
 19%|█▉        | 18/96 [00:36<00:37,  2.08it/s]
 25%|██▌       | 24/96 [00:37<00:25,  2.87it/s]
 31%|███▏      | 30/96 [00:38<00:17,  3.76it/s]
 38%|███▊      | 36/96 [00:39<00:14,  4.23it/s]
 42%|████▏     | 40/96 [00:40<00:12,  4.40it/s]
 43%|████▎     | 41/96 [00:41<00:16,  3.34it/s]
 45%|████▍     | 43/96 [00:42<00:16,  3.14it/s]
 46%|████▌     | 44/96 [00:43<00:21,  2.39it/s]
 48%|████▊     | 46/96 [00:44<00:22,  2.26it/s]
 49%|████▉     | 47/96 [00:45<00:26,  1.87it/s]
 51%|█████     | 49/96 [01:10<03:13,  4.12s/it]
 52%|█████▏    | 50/96 [01:10<02:36,  3.40s/it]
 55%|█████▌    | 53/96 [01:10<01:23,  1.94s/it]
 58%|█████▊    | 56/96 [01:10<00:48,  1.21s/it]
 61%|██████▏   | 59/96 [01:10<00:29,  1.25it/s]
 65%|██████▍   | 62/96 [01:10<00:18,  1.84it/s]
 71%|███████   | 68/96 [01:10<00:08,  3.48it/s]
 84%|████████▍ | 81/96 [01:10<00:01,  8.42it/s]
 91%|█████████ | 87/96 [01:11<00:00, 10.71it/s]
 97%|█████████▋| 93/96 [01:11<00:00, 13.40it/s]
100%|██████████| 96/96 [01:11<00:00,  1.34it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     96        
Failed requests:                         0         
Maximum request concurrency:             48        
Benchmark duration (s):                  71.43     
Total input tokens:                      103333    
Total generated tokens:                  24576     
Request throughput (req/s):              1.34      
Output token throughput (tok/s):         344.06    
Peak output token throughput (tok/s):    768.00    
Peak concurrent requests:                54.00     
Total token throughput (tok/s):          1790.71   
---------------Time to First Token----------------
Mean TTFT (ms):                          8135.70   
Median TTFT (ms):                        7992.88   
P99 TTFT (ms):                           16720.52  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          107.02    
Median TPOT (ms):                        110.99    
P99 TPOT (ms):                           139.36    
---------------Inter-token Latency----------------
Mean ITL (ms):                           106.60    
Median ITL (ms):                         64.63     
P99 ITL (ms):                            1105.91   
==================================================